In [14]:
import pandas as pd
dfFivePoints = pd.read_csv('Data/restructured_fivepointstest.csv')

In [15]:
rows = dfFivePoints['student_id'].value_counts().reset_index()
rows.columns = ['student_id', 'total_patterns']

# Groepeer de rijen op basis van 'student_id' en neem de som van de 'pattern' waar deze gelijk is aan "0,0,0,0,0,0,0,0"
sum_of_pattern = dfFivePoints[dfFivePoints['patternsm'] == "0,0,0,0,0,0,0,0"].groupby('student_id')['patternsm'].count().reset_index()
sum_of_pattern.columns = ['student_id', 'sum_invalid_pattern']

total_duplicates = dfFivePoints.groupby('student_id').size().reset_index()
total_duplicates.columns = ['student_id', 'total_duplicates']

# Voeg de sommen toe aan de oorspronkelijke DataFrame
rows = pd.merge(rows, sum_of_pattern, on='student_id', how='left')

rows

      student_id  total_patterns  sum_invalid_pattern
0            879             209                192.0
1           1161             175                156.0
2            748             164                137.0
3           9884             151                 66.0
4           2639             137                 77.0
...          ...             ...                  ...
4545        1354               1                  1.0
4546        9780               1                  1.0
4547        7132               1                  1.0
4548        5300               1                  1.0
4549        3467               1                  NaN

[4550 rows x 3 columns]

In [16]:
# Filter out rows with 'patternsm' not equal to '0,0,0,0,0,0,0,0'
non_zero_df = dfFivePoints[dfFivePoints['patternsm'] != '0,0,0,0,0,0,0,0']

# Group by 'student_id' and count the unique patterns
unique_patterns_per_student = non_zero_df.groupby('student_id')['patternsm'].nunique().reset_index()
unique_patterns_per_student.columns = ['student_id', 'unique_patterns_count']

# Calculate the total count of values for each student, including zeros
total_values_per_student = dfFivePoints.groupby('student_id')['patternsm'].count().reset_index()
total_values_per_student.columns = ['student_id', 'total_values_count']

# Calculate the total count of values for each student, excluding zeros
total_non_zero_values_per_student = non_zero_df.groupby('student_id')['patternsm'].count().reset_index()
total_non_zero_values_per_student.columns = ['student_id', 'total_non_zero_values_count']

# Merge the DataFrames to create the new DataFrame
new_df = pd.merge(unique_patterns_per_student, total_values_per_student, on='student_id')
new_df = pd.merge(new_df, total_non_zero_values_per_student, on='student_id')

# Calculate the "duplicates" column
new_df['duplicates'] = new_df['total_non_zero_values_count'] - new_df['unique_patterns_count']

new_df.head()

,student_id,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
0,1,5,12,6,1
1,2,26,28,28,2
2,3,38,48,47,9
3,4,54,64,62,8
4,5,48,63,62,14

In [17]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4535 entries, 0 to 4534
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student_id                   4535 non-null   int64
 1   unique_patterns_count        4535 non-null   int64
 2   total_values_count           4535 non-null   int64
 3   total_non_zero_values_count  4535 non-null   int64
 4   duplicates                   4535 non-null   int64
dtypes: int64(5)
memory usage: 177.3 KB

In [18]:
# combine the DataFrames
combine = pd.merge(rows, new_df, on='student_id', how='left')

combine.head()

,student_id,total_patterns,sum_invalid_pattern,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
0,879,209,192.0,6.0,209.0,17.0,11.0
1,1161,175,156.0,17.0,175.0,19.0,2.0
2,748,164,137.0,25.0,164.0,27.0,2.0
3,9884,151,66.0,28.0,150.0,84.0,56.0
4,2639,137,77.0,16.0,137.0,60.0,44.0

In [19]:
combine.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4550 entries, 0 to 4549
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   student_id                   4550 non-null   int64
 1   total_patterns               4550 non-null   int64
 2   sum_invalid_pattern          2709 non-null   float64
 3   unique_patterns_count        4535 non-null   float64
 4   total_values_count           4535 non-null   float64
 5   total_non_zero_values_count  4535 non-null   float64
 6   duplicates                   4535 non-null   float64
dtypes: float64(5), int64(2)
memory usage: 249.0 KB

In [20]:
#check student_id 1 in df combine
combine[combine['student_id'] == 1]

,student_id,total_patterns,sum_invalid_pattern,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
4435,1,12,6.0,5.0,12.0,6.0,1.0

In [21]:
combine.describe()

,student_id,total_patterns,sum_invalid_pattern,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
count,4550.000000,4550.000000,2709.000000,4535.000000,4535.000000,4535.000000,4535.000000
mean,5218.844615,41.090769,3.679587,34.485777,41.214333,39.026681,4.540904
std,3034.395206,15.281930,7.619551,12.668231,15.144443,14.168762,4.966899
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000
25%,2619.250000,31.000000,1.000000,26.000000,32.000000,30.000000,2.000000
50%,5223.500000,41.000000,2.000000,35.000000,41.000000,39.000000,3.000000
75%,8020.750000,50.000000,4.000000,43.000000,50.000000,48.000000,6.000000
max,10058.000000,209.000000,192.000000,82.000000,209.000000,113.000000,81.000000

In [22]:
# check for na values
combine.isna().sum()

#show the rows with total_values_count is nan
combine[combine['total_values_count'].isna()]

,student_id,total_patterns,sum_invalid_pattern,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
4489,2060,7,7.0,NaN,NaN,NaN,NaN
4506,8159,6,6.0,NaN,NaN,NaN,NaN
4515,9782,5,5.0,NaN,NaN,NaN,NaN
4516,9781,4,4.0,NaN,NaN,NaN,NaN
4517,9768,4,4.0,NaN,NaN,NaN,NaN
4521,9743,4,4.0,NaN,NaN,NaN,NaN
4527,9800,3,3.0,NaN,NaN,NaN,NaN
4531,9849,3,3.0,NaN,NaN,NaN,NaN
4532,2690,3,3.0,NaN,NaN,NaN,NaN
4533,5156,3,3.0,NaN,NaN,NaN,NaN
4544,9887,1,1.0,NaN,NaN,NaN,NaN
4545,1354,1,1.0,NaN,NaN,NaN,NaN
4546,9780,1,1.0,NaN,NaN,NaN,NaN
4547,7132,1,1.0,NaN,NaN,NaN,NaN
4548,5300,1,1.0,NaN,NaN,NaN,NaN

In [23]:
#drop the rows with total_values_count is nan
combine = combine.dropna(subset=['total_values_count'])

combine.describe()

,student_id,total_patterns,sum_invalid_pattern,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
count,4535.000000,4535.000000,2694.000000,4535.000000,4535.000000,4535.000000,4535.000000
mean,5211.797574,41.216318,3.682628,34.485777,41.214333,39.026681,4.540904
std,3031.720770,15.149795,7.639376,12.668231,15.144443,14.168762,4.966899
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000
25%,2616.500000,32.000000,1.000000,26.000000,32.000000,30.000000,2.000000
50%,5216.000000,41.000000,2.000000,35.000000,41.000000,39.000000,3.000000
75%,8003.500000,50.000000,4.000000,43.000000,50.000000,48.000000,6.000000
max,10058.000000,209.000000,192.000000,82.000000,209.000000,113.000000,81.000000

In [24]:
#fill sum_invalid_pattern with 0
combine['sum_invalid_pattern'] = combine['sum_invalid_pattern'].fillna(0)

combine.describe()

,student_id,total_patterns,sum_invalid_pattern,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
count,4535.000000,4535.000000,4535.000000,4535.000000,4535.000000,4535.000000,4535.000000
mean,5211.797574,41.216318,2.187652,34.485777,41.214333,39.026681,4.540904
std,3031.720770,15.149795,6.159104,12.668231,15.144443,14.168762,4.966899
min,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,0.000000
25%,2616.500000,32.000000,0.000000,26.000000,32.000000,30.000000,2.000000
50%,5216.000000,41.000000,1.000000,35.000000,41.000000,39.000000,3.000000
75%,8003.500000,50.000000,2.000000,43.000000,50.000000,48.000000,6.000000
max,10058.000000,209.000000,192.000000,82.000000,209.000000,113.000000,81.000000

In [25]:
#check student_id 1 in df combine
combine[combine['student_id'] == 1]

,student_id,total_patterns,sum_invalid_pattern,unique_patterns_count,total_values_count,total_non_zero_values_count,duplicates
4435,1,12,6.0,5.0,12.0,6.0,1.0